<template>
  <div dir="rtl">
      
    <ul class="list d-flex flex-column align-items-right text-right
      ">
      <li>
        ما شک های خود را فرو می خوریم و از گله پیروی می کنیم، زیرا نمی توانیم
        خود را پیشگام درک حقایق دشواری بدانیم که پیش از این ناشناخته بوده است.
      </li>
      <li>
        اپیکور به ویژه این دغدغه را داشت که خود و دوستانش بیاموزند که اضطراب‌
        ها و نگرانی‌ های خود درباره‌ی پول، بیماری، مرگ و امور فراطبیعی را تحلیل
        کنند. اگر کسی به‌ طور عقلانی به میرایی و فناپذیر بودن بیندیشد، به نظر
        اپیکور، در می‌ یابد که پس از مرگ چیزی جز فراموشی و نسیان وجود ندارد، و
        «بیهوده است که از قبل نگران چیزی باشیم که چون فرا می‌رسد مشکلی نمی‌
        آفریند.» بی‌ معناست اگر پیشاپیش از حالتی بترسیم که هرگز تجربه نخواهیم
        کرد: برای کسی که واقعا دریافته باشد در مرگ هیچ چیز هولناکی وجود ندارد،
        هیچ چیز هراسناکی در زندگی هم وجود ندارد.
      </li>
      <li>
        اپیکور به ویژه این دغدغه را داشت که خود و دوستانش بیاموزند که اضطراب‌
        ها و نگرانی‌ های خود درباره‌ی پول، بیماری، مرگ و امور فراطبیعی را تحلیل
        کنند. اگر کسی به‌ طور عقلانی به میرایی و فناپذیر بودن بیندیشد، به نظر
        اپیکور، در می‌ یابد که پس از مرگ چیزی جز فراموشی و نسیان وجود ندارد، و
        «بیهوده است که از قبل نگران چیزی باشیم که چون فرا می‌رسد مشکلی نمی‌
        آفریند.» بی‌ معناست اگر پیشاپیش از حالتی بترسیم که هرگز تجربه نخواهیم
        کرد: برای کسی که واقعا دریافته باشد در مرگ هیچ چیز هولناکی وجود ندارد،
        هیچ چیز هراسناکی در زندگی هم وجود ندارد.
      </li>
    </ul>
  </div>
</template>

<script>
export default {
    data(){
        return{
            show:false,
        }
    }
}
</script>

<style  scoped>
.list{
    height: 250px;
    overflow-y: scroll;
    width: 450px;
    z-index: 999;
    background-color: #FFFFFF;
    color: #808080;
    padding: 50px;
    border-radius: 10px;
    font-weight: 400;
    line-height: 28px;
}
li{
    margin-bottom: 20px;
    border-bottom: 1px solid black;

}

li:last-of-type{
border-bottom: 1px solid white;
}

</style>